Repository: Alusus/Alwarsha
Catalog: po/*.po
Languages: ar

source: Installing project
ar: تثبيت المشروع

source: Create or update code-index for project file
ar: إنشاء أو تحديث فهرسة الكود لملف المشروع

source: Failed to load flags for plan: %s
ar: فشل في تحميل الأعلام للخطة: %s

source: Failed to cull index plan: %s
ar: فشل انتقاء خطة الفهرسة: %s

source: Failed to populate index plan: %s
ar: فشل ملء خطة الفهرسة: %s

source: Failed to load project: %s
ar: فشل تحميل المشروع: %s

source: Indexing Source Code
ar: فهرسة الشفرة المصدرية

source: Search, diagnostics, and autocompletion may be limited until complete.
ar: البحث والتشخيص والإكمال التلقائي قد يكونون محدودين لحين الانتهاء.

source: Declaration
ar: التصريح

source: Colors
ar: الألوان

source: Palette name
ar: اسم لوحة الألوان

source: Enter a new name for the palette
ar: أدخل اسمًا جديدًا للوحة الألوان

source: Save changes to palette before closing?
ar: أترغب بحفظ تغييرات لوحة الألوان قبل الإغلاق؟

source: Close without Saving
ar: أغلق دون حفظ

source: Save As…
ar: احفظ باسم…

source: Load palette
ar: حمل لوحة الألوان

source: Save palette
ar: احفظ لوحة الألوان

source: All files
ar: كل الملفات

source: All supported palettes formats
ar: كل صيغ اللوحات المدعومة

source: GIMP palette
ar: لوحة GIMP

source: Alwarsha palette
ar: لوحة الورشة

source: HSV visibility
ar: رؤية HSV

source: If the HSV components are visible.
ar: إذا ما كانت عناصر HSV مرئية.

source: LAB visibility
ar: رؤية LAB

source: If the LAB components are visible.
ar: إذا ما كانت عناصر LAB مرئية.

source: RGB visibility
ar: رؤية RGB

source: If the RGB components are visible.
ar: إذا ما كانت عناصر RGB مرئية.

source: RGB unit
ar: وحدة RGB

source: The unit used by RGB component and strings.
ar: الوحدة المستخدمة من قبل عنصر ونصوص RGB.

source: Selected palette ID
ar: معرف اللوحة المختارة

source: The selected palette ID among the loaded ones.
ar: معرف اللوحة المختارة من بين اللوحات المحملة.

source: Color strings visibility
ar: رؤية النصوص اللونية

source: The visible color strings.
ar: النصوص اللونية المرئية.

source: Color filter
ar: مرشح اللون

source: The filter used on the color scales and color plane.
ar: المرشح المستخدم في مقاييس ومستوى الألوان

source: Color components
ar: مكونات اللون

source: Visibility:
ar: الرؤية:

source: Select the color spaces for which you want to see sliders in the panel.
ar: حدد مساحة الألوان التي تريد رؤيتها في اللوحة

source: Units:
ar: الوحدات:

source: Select the type of unit you want to use for RGB components and strings in the panel.
ar: اختر نوع الوحدة التي ترغب باستخدامها لمكونات ونصوص RGB في اللوحة.

source: Percent
ar: نسبة مؤوية

source: Filters:
ar: مرشحات:

source: Select a filter that act on the colors or “None”.
ar: اختر مرشحًا لتطبيقه على الألوان او “بلا”.

source: None
ar: بلا

source: Achromatopsia (monochromacy)
ar: عمى الألوان التام

source: Achromatomaly (blue cone monochromacy)
ar: أكروماتومالي (عمى المخاريط الزرقاء)

source: Deuteranopia (green-blind)
ar: عمى اللون الأخضر

source: Deuteranomaly (green-weak)
ar: ضعف اللون الأخضر

source: Protanopia (red-blind)
ar: عمى اللون الأحمر

source: Protanomaly (red-weak)
ar: ضعف اللون الأحمر

source: Tritanopia (blue-blind)
ar: عمى اللون الأزرق

source: Tritanomaly (blue-weak)
ar: ضعف اللون الأزرق

source: Websafe
ar: آمنة للويب

source: Select the color strings you want to see in the panel.
ar: اختر النصوص اللونية التي تريد رؤيتها في اللوحة.

source: Palettes options
ar: خصائص لوحات الألوان

source: Palette view mode:
ar: نمط اظهار اللوحة:

source: List
ar: قائمة

source: Swatches
ar: نماذج

source: Palette management
ar: إدارة لوحة الألوان

source: Load
ar: حمل

source: From current document
ar: من المستند الحالي

source: Select the palette you want to see in the panel or close one.
ar: اختر لوحة الألوان التي تريد رؤيتها في اللوحة أو لوحة قريبة.

source: No loaded palettes
ar: لا لوحات ألوان محملة

source: No selected palettes
ar: لا لوحات ألوان مختارة

source: Select a palette file
ar: اختر ملف لوحة ألوان

source: Try loading or generating a palette using the menu
ar: حاول تحميل او توليد لوحة باستخدام القائمة

source: Highlight _colors
ar: أ_لوان التظليل

source: Highlight colors
ar: ألوان التظليل

source: Workspace Shortcuts
ar: اختصارات مساحة العمل

source: Command Bar
ar: شريط الأوامر

source: Show the workspace command bar
ar: أظهر شريط الأوامر لمساحة العمل

source: Comment the code
ar: تعليق الكود

source: Uncomment the code
ar: إلغاء تعليق الكود

source: _Comment code
ar: _علق الكود

source: Comment code
ar: علق الكود

source: Unco_mment code
ar: ألغ تع_ليق الكود

source: Uncomment code
ar: ألغ تعليق الكود

source: Update Copyright
ar: حدث حقوق الملكية

source: When saving a file Builder will automatically update copyright information for you
ar: عند حفظ ملف سيقوم الباني تلقائيًا بتحديث حقوق الملكية لك

source: update copyright save
ar: حفظ تحديث حقوق الملكية

source: Update Copyright before Saving
ar: حدث حقوق الملكية قبل الحفظ

source: Updates the copyright for the user before saving to disk.
ar: تحديث حقوق الملكية للمستخدم قبل الحفظ على القرص.

source: Display the project creation guide
ar: اعرض إرشادات إنشاء المشروع

source: Characters were used which might cause technical issues as a project name
ar: المحارف التي تم استخدامها يمكن ان تسبب مشاكلاً تقنية في اسم المشروع

source: Your project will be created within a new child directory.
ar: سيتم إنشاء مشروعك ضمن مجلد ضمني جديد.

source: Directory already exists with that name
ar: يوجد مجلد بنفس الاسم

source: Your project will be created within %s.
ar: سيتم انشاء مشروعك ضمن %s.

source: Application ID is not valid.
ar: معرف التطبيق غير صالح.

# title
source: Start New Project
ar: ابدأ مشروعًا جديدًا

source: A failure occurred while initializing version control
ar: حدث خطأ أثناء تهيئة إدارة الشفرة المصدرية

source: Project Name
ar: اسم المشروع

source: Unique name that is used for your project’s folder and other technical resources. Should be in lower case without spaces and may not start with a number.
ar: الاسم الفريد المستخدم لمجلد مشروعك والموارد التقنية الأخرى. يجب أن تكون بأحرف صغيرة بدون مسافات ويجب أن لا تبدأ برقم.

source: Application ID
ar: معرف التطبيق

source: The Application ID is a reverse domain-name identifier used to uniquely identify your application such as “org.gnome.Builder”.
ar: معرف التطبيق هو معرف عكسي لنطاق إنترنت ويستخدم لتعريف التطبيق الخاص بك بشكل فريد, مثل “org.gnome.Builder”.

source: Project Location
ar: موقع المشروع

source: Select Project Directory
ar: حدد مجلد المشروع

source: Language
ar: اللغة

source: License
ar: الرخصة

source: No license
ar: بلا رخصة

source: Uses the Git version control system
ar: يستخدم نظام GIT لإدارة الشفرة المصدرية

source: _Create Project
ar: _أنشئ مشروعًا

source: Create Project
ar: أنشئ مشروعًا

source: Select a Template
ar: اختر قالبًا

source: Start _New Project…
ar: ابدأ _مشروعًا جديدًا…

source: _Start New Project…
ar: _إبدأ مشروعًا جديدًا…

source: Suggest completions using Ctags
ar: اقترح إكمالات باستخدام Ctags

source: Use Ctags to suggest completions for a variety of languages
ar: استخدم Ctags لاقتراح إكمالات للعديد من لغات البرمجة

source: Search, autocompletion, and symbol information may be limited until Ctags indexing is complete.
ar: البحث والإكمال التلقائي ومعلومات الرموز قد تكون محدودة حتى تكتمل فهرسة Ctags.

source: Indexing Source Code (Paused)
ar: فهرسة الشفرة المصدرية (متوقفة مؤقتًا)

source: Run with Debugger
ar: نفذ باستخدام المنقح

source: Run with _Debugger
ar: نفذ باستخدام المن_قح

source: ID
ar: المعرف

source: File
ar: ملف

source: Line
ar: سطر

source: Function
ar: دالة

source: Address
ar: عنوان

source: Type
ar: نوع

source: Hits
ar: إصابات

source: Expression
ar: تركيب

source: Interrupt the program
ar: قاطع البرنامج

source: Continue running the program
ar: استمر في تنفيذ البرنامج

source: Execute the current line, stepping into any function calls
ar: نفّذ السطر الحالي متوقفًا في أي استدعاء فرعي

source: Execute the current line, stepping over any function calls
ar: نفذ السطر الحالي دون التوقف في الاستدعاءات الفرعية

source: Run until the end of the function
ar: نفذ حتى نهاية الدالة

source: Disassembly
ar: التفكيك

source: Failed to start the debugger
ar: فشل تشغيل المنقح

source: Threads
ar: المسالك

source: Libraries
ar: المكتبات

source: Registers
ar: السجلات

source: Console
ar: وحدة التحكم

source: No break
ar: بدون توقف

source: Breakpoint
ar: نقطة توقف

source: Countpoint
ar: نقطة عد

source: Library
ar: المكتبة

source: Address Range
ar: نطاق العنوان

source: Locals
ar: محليات

source: Parameters
ar: معطيات

source: Variable
ar: متغيرات

source: Register
ar: سجل

source: Group
ar: مجموعة

source: Thread
ar: مسلك

source: Frame
ar: اطار

source: Arguments
ar: مدخلات

source: Location
ar: موقع

source: Binary
ar: ثنائي

source: _Select Documentation…
ar: _اختر التوثيق…

source: Documentation
ar: التوثيق

source: Reveal search bar with Ctrl+F
ar: اكشف شريط البحث بـCtrl+F

source: Previous search result (Ctrl+Shift+G)
ar: نتيجة البحث السابقة (Ctrl+Shift+G)

source: Next search result (Ctrl+G)
ar: نتيجة البحث التالية (Ctrl+G)

source: Close search bar (Escape key)
ar: أغلق شريط البحث (Escape key)

source: Print…
ar: اطبع…

source: New _Documentation Page
ar: صفحة _توثيق جديدة

source: Display D-Bus inspector
ar: اعرض مفتش D-Bus

source: D-Bus Inspector…
ar: مفتش D-Bus…

source: Connected to “%s”
ar: متصل ب“%s”

source: System
ar: نظام

source: Session
ar: جلسة

source: Other
ar: غيره

source: Execute
ar: تنفيذ

source: Object Path
ar: مسار الهدف

source: Interface
ar: واجهة

source: Method
ar: طريقة

source: Result
ar: نتيجة

source: Copy
ar: نسخ

source: Elapsed Time
ar: الوقت المنقضي

source: Bus Address
ar: عنوان الـBus

source: Owner
ar: المالك

source: Process ID
ar: معرف العملية

source: Activatable
ar: قابل للتنشيط

source: Yes
ar: نعم

source: No
ar: لا

source: read/write
ar: قراءة/كتابة

source: write-only
ar: كتابة-فقط

source: read-only
ar: قراءة-فقط

source: Interfaces
ar: واجهات

source: Methods
ar: طرق

source: Properties
ar: خصائص

source: Signals
ar: إشارات

source: Array of [%s]
ar: مصفوفة من [%s]

source: Access Denied by Peer
ar: رُفض الدخول من قبل القرين

source: Authentication Failed
ar: فشلت المصادقة

source: Operation Timed Out
ar: نفد وقت العملية

source: Lost Connection to Bus
ar: فقد الاتصال مع الناقل

source: D-Bus Connection Failed
ar: فشل الاتصال مع D-Bus

source: Connect
ar: اتصل

source: Provide the address of the message bus
ar: زود بعنوان ناقل الرسائل

source: Connect to Other Bus
ar: اتصل بناقل مختلف

source: Search Bus Names
ar: ابحث بين أسماء النواقل

source: Bus Names
ar: أسماء النواقل

source: Select a Bus Name
ar: اختر اسم الناقل

source: Select a bus name to introspect the peer.
ar: اختر اسم الناقل لتفحص القرين.

source: There is a file with unsaved changes. Save changes before closing?
ar: يوجد ملف بتغييرات غير محفوظة. أتود حفظ التغييرات قبل الإغلاق؟

source: Select the files to save:
ar: اختر الملفات للحفظ:

source: If you close without saving, all your changes will be permanently lost.
ar: إن أغلقت دون حفظ ستخسر جميع التغييرات نهائيًا

source: Use minimal editor interface
ar: استخدم واجهة مبسطة للمحرر

source: Provide a number between 1 and %u
ar: زود برقم بين 1 و %u

source: Go to line number
ar: اذهب إلى السطر رقم

source: Go to Line
ar: اذهب إلى السطر

source: _Go
ar: اذهب_

source: New Editor Workspace…
ar: مساحة عمل جديدة للمحرر…

source: New File
ar: ملف جديد

source: Move Page Left
ar: انقل الصفحة لليسار

source: Move Page Right
ar: انقل الصفحة لليمين

source: Close Frame
ar: أغلق الإطار

source: Document
ar: مستند

source: Open in New Frame
ar: افتح في إطار جديد

source: Open in New Workspace
ar: افتح في مساحة عمل جديدة

source: Split
ar: قسّم

source: Save _As
ar: احفظ _باسم

source: No file was provided.
ar: لم يُقدم أي ملف

source: Emulates the Emacs text editor
ar: محاكاة محرر Emacs

source: Enable the use of ESLint, which may execute code in your project
ar: تمكين استخدام ESLint، والتي قد تنفذ شفرات في مشروعك

source: eslint javascript lint code execute execution
ar: eslint javascript lint code execute execution جافاسكريبت لينت كود شفرة تنفيذ نفذ

source: Enable ESLint
ar: مكّن ESLint

source: Enable the use of eslint to find additional diagnostics in JavaScript files. This may result in the execution of code in your project.
ar: مكن استخدام ESLint لإيجاد تشخيصات إضافية في ملفات جافاسكريبت. قد يؤدي هذا لتنفيذ شفرة ضمن مشروعك.

source: Installation failed
ar: فشل التثبيت

source: Installation complete
ar: اكتمل التثبيت

source: The client has been closed
ar: تم إغلاق العميل

source: Cloning project %s
ar: نسخ المشروع %s

source: Downloading application sources…
ar: جارٍ تنزيل مصادر التطبيق…

source: Failed to remove flatpak manifest: %s
ar: فشل إزالة بيان فلاتباك: %s

source: Network is not available, skipping downloads
ar: الشبكة غير متوفرة؛ تجاهل التحميل

source: Install Missing SDK?
ar: أترغب بتثبيت عدة تطوير البرمجيات (SDK) المفقودة؟

source: _Install
ar: تثبيت_

source: Alwarsha needs to install the following software development kits to build your project.
ar: تحتاج الورشة إلى تثبيت عدد تطوير البرمجيات التالية لبناء مشروعك.

source: Architecture
ar: البنية المعمارية

source: Creating flatpak workspace
ar: إنشاء مساحة عمل فلاتباك

source: Preparing build directory
ar: تحضير مجلد البناء

source: Downloading dependencies
ar: تنزيل الاعتماديات

source: Building dependencies
ar: بناء الاعتمادات

source: Finalizing flatpak build
ar: تشطيب بناء فلاتباك

source: Exporting staging directory
ar: تصدير مجلد الانطلاق

source: Creating flatpak bundle
ar: إنشاء حزمة فلاتباك

source: Flatpak
ar: فلاتباك

source: Installing Necessary SDKs
ar: تثبيت العدد الضرورية لتطوير البرمجيات

source: Builder is installing Software Development Kits necessary for building your application.
ar: يقوم الباني بتثبيت عدد تطوير البرمجيات الضرورية لبناء تطبيقك.

source: No repository to access file contents
ar: لا يوجد مستودع للوصول إلى محتويات الملف

source: No contents have been set to diff
ar: لم يتم ضبط اي محتويات للمقارنة

source: The operation failed. The original error was "%s"
ar: فشلت العملية. الخطأ الأصلي كان "%s"

source: The operation has been canceled
ar: ألغيت العملية

source: Alwarsha failed to provide appropriate credentials when cloning the repository.
ar: فشلت الورشة في توفير معطيات المصادقة المناسبة عند استنساخ المستودع.

source: Cannot set AMEND and GPG_SIGN flags
ar: لا يمكن ضبط أعلام AMEND و CPG_SIGN

source: Cannot sign commit without GPG_KEY_ID
ar: لا يمكن توقيع التضمين بدون GPG_KEY_ID

source: Cannot monitor files outside the working directory
ar: لا يمكن مراقبة الملفات خارج مجلد العمل

source: Git version control is not in use
ar: نظام Git لإدارة الشفرة المصدرية غير مستخدم

source: Updating Git Submodules
ar: تحديث وحدات Git الفرعية

source: Network is not available, skipping submodule update
ar: الشبكة غير متاحة؛ تجاهل تحديث الوحدات الفرعية

source: Initialize git submodules
ar: تهيئة الوحدات الفرعية ل git

source: Pushed.
ar: دُفعت التضمينات.

source: Pushing ref “%s”
ar: دفع المرجع “%s”

source: Directory is not within repository
ar: المجلد ليس ضمن المستودع

source: A repository could not be found at “%s”.
ar: لم يُعثر على مستودع في “%s”.

source: The protocol “%s” is not supported.
ar: البروتوكول “%s” غير مدعوم.

source: Cloning repository
ar: ينسخ المستودع

source: A valid Git URL is required
ar: مطلوب عنوان Git صالح

source: Select Widget…
ar: اختر ودجة…

source: _Select Widget…
ar: اختر_ ودجة…

source: _View Design
ar: ا_عرض التصميم

source: Switch to UI designer
ar: انتقل إلى مصمم واجهة المستخدم

source: _View Source
ar: ا_عرض المصدر

source: Switch to source code editor
ar: انتقل إلى محرر الشفرة المصدرية

source: Failed to save glade document: %s
ar: قشل في حفظ مستند glade: %s

source: Glade shortcuts
ar: Glade اختصارات

source: Designer
ar: مصمم

source: Save the interface design
ar: احفظ تصميم الواجهة

source: Preview the interface design
ar: معاينة تصميم الواجهة

source: Undo the last command
ar: تراجع عن آخر أمر

source: Redo the next command
ar: أعد تنفيذ الأمر التالي

source: Switch to selection mode
ar: قم بالتبديل إلى وضع التحديد

source: Switch to drag-resize mode
ar: قم بالتبديل إلى وضع السحب وتغيير الحجم

source: Switch to margin editor
ar: قم بالتبديل إلى محرر الهامش

source: Switch to alignment editor
ar: قم بالتبديل إلى محرر المحاذاة

source: Unnamed Glade project
ar: مشروع Glade بدون اسم

source: Unnamed Glade Project
ar: مشروع Glade بدون اسم

source: Widget specific properties
ar: خصائص متعلقة بالودجة

source: Container child properties
ar: خصائص تابعة للحاوية

source: Styling, alignment, and other common properties
ar: التصميم والمحاذاة والخصائص الشائعة الأخرى

source: Accessibility properties
ar: خصائص تمكين الوصول

source: Open _Preview
ar: افتح ال_معاينة

source: Cut
ar: قص

source: Paste
ar: ألصق

source: Delete
ar: احذف

source: Undo
ar: تراجع

source: Redo
ar: تقدم

source: UI Designer
ar: مصمم واجهة المستخدم

source: _UI Designer
ar: مصمم _واجهة المستخدم

source: Code assistance requires a local file.
ar: مساعدة الشفرة تتطلب ملفًا محليًا.

source: Enable the use of pylint, which may execute code in your project
ar: تمكين استخدام pylint والذي قد يؤدي لتنفيذ شفرة ضمن مشروعك

source: pylint python lint code execute execution
ar: pylint python lint code execute execution لينت بايثون كود شفرة تنفيذ نفذ

source: No language specified
ar: لم يتم تحديد لغة

source: Enable Pylint
ar: مكّن Pylint

source: Enable the use of pylint to find additional diagnostics in Python programs. This may result in the execution of code in your project.
ar: مكّن استخدام pylint لإيجاد تشخيصات إضافية في برمجيات بايثون. قد يؤدي هذا لتنفيذ شفرة في مشروعك.

source: Gradle Wrapper
ar: غلاف Gradle

source: Display a new greeter window
ar: اعرض نافذة ترحيب جديدة

source: Begin cloning project from URI
ar: بدء نسخ المشروع من عنوان الويب

source: Quit
ar: اخرج

source: Open a _Project…
ar: افتح _مشروعًا…

source: Show Find in Project panel
ar: أظهر البحث في لوحة المشروع

source: Match
ar: تطابق

source: Path
ar: مسار

source: _Find in %s
ar: _جد في %s

source: _Replace in %s
ar: ا_ستبدل في %s

source: Replace With
ar: استبدل بـ

source: Find in Files
ar: ابحث في الملفات

source: Find and Replace
ar: البحث والاستبدال

source: R_ecursive
ar: ال_عَودية

source: Match _Case
ar: طابق _حالة الأحرف

source: Match _Words
ar: طابق ال_كلمات

source: Regular E_xpressions
ar: التعابير ال_نمطية

source: Close the panel (Escape key)
ar: أغلق اللوحة (مفتاح الخروج)

source: _Find in Project
ar: _جِد في المشروع

source: _Replace in Project
ar: ا_ستبدل في المشروع

source: Search for…
ar: ابحث عن…

source: _Find
ar: جِد_

source: Search _recursively through folders
ar: ابحث بشكل _عَودي عبر المجلدات

source: Match _case when searching
ar: طابق _حالة الأحرف عند البحث

source: Match _whole words
ar: مطابقة _كامل الكلمة

source: Allow regular _expressions
ar: السماح بالتعابير ال_نمطية

source: _Find in Files
ar: _جِد في المفات

source: Open Preview
ar: افتح المعاينة

source: Your computer is missing python3-docutils
ar: يفتقر حاسوبك إلى python3-docutils

source: This package is necessary to provide previews of markup-based documents.
ar: هذه الحزمة ضرورية لتقديم معاينات للمستندات القائمة على الترميز.

source: Install Package
ar: تثبيت الحزمة

source: Your computer is missing python3-sphinx
ar: يفتقر حاسوبك إلى python3-sphinx

source: (Preview)
ar: (معاينة)

source: Failed to load directory: %s
ar: فشل في تحميل المجلد: %s

source: %s — Directory
ar: %s - مجلد

source: Size
ar: حجم

source: Modified
ar: معدل

source: _Browse Folder
ar: ت_صفح المجلد

source: Browse Folder
ar: تصفح المجلد

source: S_witch to Folder
ar: ب_دل للمجلد

source: Switch to Folder
ar: بدل للمجلد

source: _Open Containing Folder
ar: ا_فتح المجلد الحاوي

source: Open Containing Folder
ar: افتح المجلد الحاوي

source: Build project
ar: ابنِ المشروع

source: Install project
ar: ثبت المشروع

source: Empty Makefile Project
ar: مشروع Makefile فارغ

source: Create a new empty project using a simple Makefile
ar: أنشئ مشروعًا فارغًا باستخدام Makefile بسيط

source: GNOME Application (Legacy)
ar: تطبيق جينوم (قديم)

source: Create a GNOME application with GTK 3
ar: أنشئ تطبيق جنوم باستخدام GTK 3

source: GNOME Application
ar: تطبيق جنوم

source: Create a GNOME application with GTK 4
ar: أنشئ تطبيق جنوم باستخدام GTK 4

source: Shared Library
ar: مكتبة مشتركة

source: Create a new project with a shared library
ar: أنشئ مشروعًا جديدًا مع مكتبة مشتركة

source: Empty Project
ar: مشروع فارغ

source: Create a new empty project
ar: أنشئ مشروعًا فارغًا جديدًا

source: Command Line Tool
ar: أداة سطر الأوامر

source: Create a new command line project
ar: أنشئ مشروع سطر أوامر جديد

source: Meson Options
ar: خيارات Meson

source: A Meson-based project is loaded but meson could not be found.
ar: حُمل مشروع مبني على Meson لكن برنامج meson مفقود

source: A Meson-based project is loaded but Ninja could not be found.
ar: حُمل مشروع مبني على Meson لكن برنامج Ninja مفقود

source: Delete Tool
ar: أداة الحذف

source: Add toolchain
ar: أضف صندوق أدوات

source: Define a new custom toolchain targeting a specific platform
ar: عرف سلسلة أدوات جديدة تستهدف منصة معينة

source: Toolchain
ar: صندوق أدوات

source: No Provided Tool
ar: لا توجد أداة متوفرة

source: A name to identify the sysroot.
ar: اسم تعريفي لـsysroot.

source: The system architecture of the sysroot.
ar: بنية النظام لـsysroot.

source: Add Tool:
ar: أضف أداة:

source: Compiler
ar: مترجم

source: Preprocessor
ar: معالج تمهيدي

source: Archiver
ar: مؤرشف

source: Linker
ar: مجمِّع

source: Strip
ar: شريط

source: Executable wrapper
ar: غلاف قابل للتنفيذ

source: Package Config
ar: تكوين الحزم

source: Any language
ar: أي لغة

source: Add Tool
ar: أضف أداة

source: Delete Toolchain
ar: احذف صندوق أدوات

source: Messages
ar: رسائل

source: Suggested GNOME Projects
ar: مشاريع جنوم المقترحة

source: Boxes
ar: صناديق

source: A simple GNOME 3 application to access remote or virtual systems
ar: تطبيق جنوم 3 بسيط للوصول إلى الأنظمة الافتراضية أو البعيدة

source: Calendar
ar: تقويم

source: Calendar application for GNOME
ar: تطبيق تقويم جنوم

source: Clocks
ar: ساعات

source: A simple clock application for GNOME
ar: تطبيق ساعة بسيط لجنوم

source: Games
ar: ألعاب

source: Simple game launcher for GNOME
ar: منصة ألعاب بسيطة لجنوم

source: Gitg is a graphical Git client
ar: Gitg هو واجهة مستخدم رسومية لـGit

source: Maps
ar: خرائط

source: A simple GNOME 3 maps application
ar: تطبيق خرائط جنوم 3 البسيط

source: Music
ar: موسيقى

source: Music player and management application
ar: تطبيق إدارة وتشغيل الملفات الصوتية

source: Default file manager for GNOME
ar: مدير الملفات الافتراضي في جنوم

source: Photos
ar: صور

source: Access, organize and share your photos on GNOME
ar: اعرض ونظم وشارك صورك على جنوم

source: An IRC Client for GNOME
ar: عميل IRC لجنوم

source: Sound Recorder
ar: مسجل صوت

source: A simple and modern sound recorder
ar: مسجل صوت بسيط وعصري

source: Build successful
ar: نجح البناء

source: Project “%s” has completed building
ar: اكتمل بناء المشروع “%s”

source: Build failed
ar: فشل البناء

source: Project “%s” failed to build
ar: فشل بناء المشروع “%s”

source: Build succeeded
ar: نجح البناء

source: Build configured
ar: تم تهيئة البناء

source: Build bootstrapped
ar: تم تمهيد البناء

source: Downloading npm dependencies
ar: تنزيل اعتمادات npm

source: _External Program…
ar: برنامج _خارجي…

source: Bootstrapping project
ar: تمهيد المشروع

source: A folder with that name already exists.
ar: مجلد بهذا الاسم موجود مسبقًا

source: A file with that name already exists.
ar: ملف بهذا الاسم موجود مسبقًا

source: File Name
ar: اسم الملف

source: Folder Name
ar: اسم المجلد

source: _Create
ar: _أنشئ

source: Copying 1 file
ar: نسخ ملف واحد

source: Copying %s of %s files
ar: نسخ %s من %s ملفات

source: Failed to copy files
ar: فشل نسخ الملفات

source: Files copied
ar: نسخت الملفات

source: Copied %s file
ar: لم يُنسخ أي ملف

source: Copying files…
ar: نسخ الملفات…

source: Files will be copied in a moment
ar: سيتم نسخ الملفات خلال لحظات
