Repository: Alusus/Alwarsha
Catalog: po/*.po
Languages: ar

source: Whether Alwarsha should use a dark theme
ar: تحديد ما إن كان على الورشة استخدام الوضع الداكن

source: dark theme
ar: سمة داكنة

source: Night Light
ar: إضاءة ليلية

source: Automatically enable dark mode at night
ar: تفعيل الوضع الداكن تلقائيًا ليلاً

source: follow night light
ar: اتبع الضوء الليلي

source: Grid Pattern
ar: نمط الشبكة

source: Display a grid pattern underneath source code
ar: اعرض نمط الشبكة خلف الشفرة المصدرية

source: Font
ar: خط

# Keywords
source: editor font monospace
ar: خط المحرر ثابت العرض

source: Number of pixels above and below editor lines
ar: عدد البكسلات فوق وأسفل أسطر المحرر

# Keywords
source: editor line spacing font monospace
ar: محرر سطر تباعد خط عرض ثابت

source: Color Scheme
ar: مخطط الألوان

source: Keyboard
ar: لوحة المفاتيح

source: Emulation
ar: محاكاة

source: Default keybinding mode which mimics gedit
ar: وضع ربط المفاتيح الافتراضي الذي يحاكي GEdit

source: Movement
ar: الحركة

source: Home moves to first non-whitespace character
ar: زر Home ينقل المؤشر إلى أول محرف مرئي

source: Backspace will remove extra space to keep you aligned with your indentation
ar: سيزيل زر الحذف المسافات الزائدة للمحافظة على المحاذاة مع الإزاحة البادئة

source: Display list of open files
ar: إظهار قائمة الملفات المفتوحة

source: Display the list of all open files in the project sidebar
ar: أظهر قائمةً بكل الملفات المفتوحة في الشريط الجانبي للمشروع

source: Cursor
ar: المؤشر

source: Restore cursor position
ar: استعد موقع المؤشر

source: Restore cursor position when a file is reopened
ar: استعد موقع المؤشر عند إعادة فتح الملف

source: Enable text wrapping
ar: تمكين التفاف النص

source: Wrap text that is too wide to display
ar: لف النص الذي يتجاوز عرض الشاشة

source: Scroll Offset
ar: إزاحة التمرير

source: Minimum number of lines to keep above and below the cursor
ar: الحد الأدنى من الأسطر لتركها فوق وأسفل المؤشر

source: Allow the editor to scroll past the end of the buffer
ar: السماح للمحرر بالتمرير بعد نهاية الصوان

source: Line Information
ar: معلومات السطر

source: Line numbers
ar: أرقام الأسطر

source: Show line number at beginning of each line
ar: أظهر رقم السطر عند بداية كل سطر

source: Relative line numbers
ar: أرقام أسطر نسبية

source: Show line numbers relative to the cursor line
ar: اجعل أرقام الأسطر نسبية مع السطر الحالي

source: Line changes
ar: تغيرات الأسطر

source: Show if a line was added or modified next to line number
ar: أظهر فيما إذا تم تعديل او إضافة سطر بجانب رقم ذلك السطر

source: Line diagnostics
ar: تشخيصات الأسطر

source: Show an icon next to line numbers indicating type of diagnostic
ar: إظهار رموز بجانب أرقام الأسطر تشير إلى نوع التشخيص

source: Highlight
ar: التظليل

source: Current line
ar: السطر الحالي

source: Make current line stand out with highlights
ar: اجعل السطر الحالي بارزًا باستخدام التظليلات

source: Matching brackets
ar: مطابقة الأقواس

source: Highlight matching brackets based on cursor position
ar: ظلل الأقواس المتطابقة بناءً على موقع المؤشر

source: Code Overview
ar: لمحة عامة عن الكود

source: A zoomed out view to enhance navigating source code
ar: عرض مصغر لتحسين التنقل في الشفرة المصدرية

source: Automatically hide overview map
ar: إخفاء الخريطة المصغرة تلقائيًا

source: Automatically hide map when editor loses focus
ar: إخفاء الخريطة تلقائيًا عندما يزال التركيز عن المحرر

source: Visible Whitespace Characters
ar: مسافات فارغة مرئية

source: New line and carriage return
ar: محارف السطر الجديد والرجوع

source: Non-breaking spaces
ar: مسافات متصلة

source: Spaces inside of text
ar: مسافات بداخل النص

source: Trailing Only
ar: في المؤخرة فقط

source: Leading Only
ar: في المقدمة فقط

source: Autosave
ar: حفظ تلقائي

source: Enable or disable autosave feature
ar: تفعيل أو تعطيل الحفظ التلقائي

source: The number of seconds after modification before auto saving
ar: عدد الثواني بعد التعديل قبل الحفظ التلقائي

source: Code Insight
ar: تنبؤ الكود

source: Highlighting
ar: التظليل

source: Semantic Highlighting
ar: التظليل الدلالي

source: Use code insight to highlight additional information discovered in source file
ar: استخدم تنبؤ الكود لتظليل معلومات إضافية كشفت في ملفالمصدر

source: Diagnostics
ar: التشخيصات

source: Completion
ar: إكمال

source: Completions Display Size
ar: حجم عرض الإكمالات

source: Number of completions to display
ar: عدد الإكمالات المراد عرضها

source: Display code suggestions interactively as you type
ar: عرض اقتراحات الكود بشكل تفاعلي أثناء الكتابة

source: Completion Providers
ar: موفرو الإكمالات

source: Snippets
ar: المقتطفات

source: Programming Languages
ar: لغات البرمجة

source: Search languages…
ar: البحث في اللغات…

source: Trim trailing whitespace
ar: حذف المسافات الذيلية

source: Upon saving, trailing whitespace from modified lines will be trimmed.
ar: عند الحفظ سيتم بتر المسافة الذيلية من الأسطر المعدلة.

source: Overwrite Braces
ar: الكتابة فوق الأقواس

source: Overwrite closing braces
ar: الكتابة فوق قوس الاغلاق

source: Insert Matching Brace
ar: إدخال قوس الإغلاق

source: Insert matching character for { [ ( or "
ar: إدخال محرف مطابق للمحارف { [ ( "

source: Insert Trailing Newline
ar: أدرج سطرًا فارغًا في ذيل المستند

source: Ensure files end with a newline
ar: تأكد من انتهاء الملفات بسطر فارغ

source: Margins
ar: الهوامش

source: Show right margin
ar: أظهر الهوامش اليمينية

source: Right margin position
ar: موقع الهوامش اليمينية

source: Position in spaces for the right margin
ar: موقع الهوامش اليمينية بالمسافات

source: Tab width
ar: عرض التبويب

source: Width of a tab character in spaces
ar: عرض محرف التبويب بعدد المسافات

source: Insert spaces instead of tabs
ar: أدرج مسافات بدل محرف التبويب

source: Prefer spaces over use of tabs
ar: تفضيل المسافات بدل استخدام محرف التبويب

source: Automatically indent
ar: إزاحة بادئة تلقائية

source: Indent source code as you type
ar: أزاحة الشفرة المصدرية تلقائيًا أثناء الكتابة

source: Spacing
ar: التباعد

source: Space before opening parentheses
ar: مسافة قبل الأقواس الفاتحة

source: Space before opening brackets
ar: مسافة قبل الأقواس المربعة الفاتحة

source: Space before opening braces
ar: مسافة قبل أقواس المشابك الفاتحة

source: Space before opening angles
ar: مسافة قبل أقواس الزاوية الفاتحة

source: Prefer a space before colons
ar: تفضيل مسافة قبل النقطتين

source: Prefer a space before commas
ar: تفضيل مسافة قبل الفاصلة

source: Prefer a space before semicolons
ar: تفضيل مسافة قبل الفاصلة المنقوطة

source: Default
ar: الافتراضية

source: Number of CPU
ar: عدد المعالجات

source: Build
ar: بناء

source: Build Workers
ar: عاملو البناء

source: Number of parallel build workers
ar: عدد عمال البناء المتوازيين

source: Clear build cache at startup
ar: تنظيف ذاكرة البناء المخبئية عند البدء

source: Expired caches will be purged when Alwarsha is started
ar: سيتم حذف الذاكرة الخبيئة منتهية الصلاحية عند تشغيل الورشة

source: Network
ar: شبكة

source: Allow downloads over metered connections
ar: السماح بالتنزيل على الاتصالات المكلفة

source: Allow the use of metered network connections when automatically downloading dependencies
ar: السماح باستخدام الشبكات المكلفة عند التنزيل التلقائي للاعتماديات

source: Debugger
ar: منقح

source: Breakpoints
ar: نقاط التوقف

source: Insert Breakpoint at Start of Application
ar: أدخل نقطة توقف عند بدء تطبيق

source: Automatically stop execution at the start of the applications main function
ar: أوقف التنفيذ بشكل تلقائي في مدخل الدالة الرئيسية للبرنامج

source: Projects
ar: المشاريع

source: Workspace
ar: مساحة العمل

source: A place for all your projects
ar: مكان لكل مشاريعك

source: Restore previously opened files
ar: استعادة الملفات المفتوحة مسبقًا

source: Open previously opened files when loading a project
ar: فتح الملفات المفتوحة مسبقاً عند تحميل مشروع

source: Version Control
ar: إدارة الشفرة المصدرية

source: SDKs
ar: عُدد تطوير البرمجيات

source: Updating Dependencies…
ar: تحديث الاعتماديات…

source: Alwarsha is updating your projects configured dependencies.
ar: الورشة تقوم بتحديث اعتماديات مشاريعك المهيأة

source: Stop running
ar: أوقف التشغيل

source: The project cannot be run while the build pipeline is being set up
ar: لايمكن تشغيل المشروع عندما يكون خط البناء قيد الإعداد

source: Change run options
ar: غيّر إعدادات التشغيل

source: Workspace shortcuts
ar: اختصارات مساحة العمل

source: Focus to the global search entry
ar: التركيز على مدخل البحث العام

# shortcut window
source: Editor Shortcuts
ar: اختصارات المحرر

# shortcut window
source: General
ar: عام

# shortcut window
source: Show help
ar: أظهر المساعدة

# shortcut window
source: Toggle primary menu
ar: تبديل ظهور القائمة الأساسية

# shortcut window
source: Global Search
ar: بحث عام

# shortcut window
source: Preferences
ar: التفضيلات

# shortcut window
source: Command Bar
ar: شريط الأوامر

# shortcut window
source: Terminal
ar: الطرفية

# shortcut window
source: Terminal in Build Runtime
ar: طرفية ضمن نظام البناء

# shortcut window
source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح

# shortcut window
source: Toggle Focus Mode
ar: تبديل وضع التركيز

# shortcut window
source: Panels
ar: اللوحات

# shortcut window
source: Toggle left panel
ar: تبديل ظهور اللوحة اليسرى

# shortcut window
source: Toggle bottom panel
ar: تبديل ظهور اللوحة السفلية

# shortcut window
source: Show Find in Project panel
ar: أظهر البحث في لوحة المشاريع

# shortcut window
source: Files
ar: ملفات

# shortcut window
source: Create new document
ar: أنشئ مستندًا جديدًا

# shortcut window
source: Open a document
ar: افتح مستندًا

# shortcut window
source: Save the document
ar: احفظ المستند

# shortcut window
source: Save a copy of the document
ar: احفظ نسخة من المستند

# shortcut window
source: Save all documents
ar: احفظ كل المستندات

# shortcut window
source: Print the document
ar: اطبع المستند

# shortcut window
source: Close the document
ar: أغلف المستند

# shortcut window
source: Close all documents
ar: أغلق كل المستندات

# shortcut window
source: Switch to the next document
ar: بدل إلى المستند التالي

# shortcut window
source: Switch to the previous document
ar: بدل إلى المستند السابق

# shortcut window
source: Show list of open documents
ar: أظهر قائمة بالمستندات المفتوحة

# shortcut window
source: Show document outline or symbol tree
ar: أظهر مخطط المستند أو شجرة الرموز

# shortcut window
source: Find and replace
ar: ابحث واستبدل

# shortcut window
source: Goto Line
ar: اذهب للسطر

# shortcut window
source: Find
ar: ابحث

# shortcut window
source: Find the next match
ar: جد التطابق التالي

# shortcut window
source: Find the previous match
ar: جد التطابق السابق

# shortcut window
source: Clear highlight
ar: أزل التظليل

# shortcut window
source: Copy and Paste
ar: انسخ وألصق

# shortcut window
source: Copy selected text to clipboard
ar: انسخ النص المحدد إلى الحافظة

# shortcut window
source: Cut selected text to clipboard
ar: قص النص المحدد وانسخه إلى الحافظة

# shortcut window
source: Paste text from clipboard
ar: ألصق النص من الحافظة

# shortcut window
source: Duplicate current line or selection
ar: كرر السطر الحالي أو التحديد

# shortcut window
source: Undo and Redo
ar: تراجع وإعادة

# shortcut window
source: Undo previous command
ar: تراجع عن الأمر السابق

# shortcut window
source: Redo previous command
ar: إعادة تنفيذ الأمر السابق

# shortcut window
source: Zoom
ar: تكبير وتصغير

# shortcut window
source: Zoom In
ar: تكبير

# shortcut window
source: Zoom Out
ar: تصغير

# shortcut window
source: Reset Zoom
ar: إعادة تعيين التكبير

# shortcut window
source: Editing
ar: تحرير

# shortcut window
source: Increment number at cursor
ar: زد الرقم عند المؤشر

# shortcut window
source: Decrement number at cursor
ar: أنقص الرقم عند المؤشر

# shortcut window
source: Join selected lines
ar: ادمج الأسطر المحددة

# shortcut window
source: Sort selected lines
ar: رتب الأسطر المحددة

# shortcut window
source: Make selection upper case
ar: حول المحدد لحالة الأحرف الكبيرة

# shortcut window
source: Make selection lower case
ar: حول المحدد لحالة الأحرف الصغيرة

# shortcut window
source: Invert selection case
ar: اعكس حالة الأحرف ضمن التحديد

# shortcut window
source: Show completion window
ar: أظهر نافذة الإكمال

# shortcut window
source: Toggle opacity of completion window
ar: تبديل شفافية نافذة الإكمال

# shortcut window
source: Toggle overwrite
ar: تبديل حالة الاستبدال عند الكتابة

# shortcut window
source: Reindent line
ar: أعد ضبط إزاحة السطر

# shortcut window
source: Delete line
ar: احذف السطر

# shortcut window
source: Rename symbol
ar: أعد تسمية الرمز

# shortcut window
source: Requires semantic language support
ar: تتطلب الدعم الدلالي للغة

# shortcut window
source: Comment code
ar: تعليق الكود

# shortcut window
source: Uncomment code
ar: إلغاء تعليق الكود

# shortcut window
source: Beautify selected code
ar: تجميل الشفرة المحددة

# shortcut window
source: Navigation
ar: التنقل

# shortcut window
source: Move to next error in file
ar: انتقل إلى الخطأ التالي في الملف

# shortcut window
source: Move to previous error in file
ar: انتقل إلى الخطأ السابق في الملف

# shortcut window
source: Move to previous edit location
ar: انتقل إلى موقع التحرير السابق

# shortcut window
source: Move to next edit location
ar: انتقل إلى موقع التحرير التالي

# shortcut window
source: Jump to definition of symbol
ar: انتقل إلى تعريف الرمز

# shortcut window
source: Find references
ar: ابحث عن المراجع

# shortcut window
source: Move viewport up within the file
ar: حرك منفذ العرض للأعلى ضمن الملف

# shortcut window
source: Move viewport down within the file
ar: حرك منفذ العرض للاسفل ضمن الملف

# shortcut window
source: Move viewport to end of file
ar: انقل منفذ العرض إلى نهاية الملف

# shortcut window
source: Move viewport to beginning of file
ar: انقل منفذ العرض إلى بداية الملف

# shortcut window
source: Move to matching bracket
ar: انتقل إلى القوس المطابق

# shortcut window
source: Selections
ar: تحديدات

# shortcut window
source: Select all
ar: حدد الكل

# shortcut window
source: Unselect all
ar: أزل التحديدات

# shortcut window
source: Build and Run
ar: بناء وتشغيل

# shortcut window
source: Build
ar: بناء

# shortcut window
source: Rebuild
ar: إعادة البناء

# shortcut window
source: Run
ar: تشغيل

# shortcut window
source: Profile
ar: تنميط

# shortcut window
source: Terminal Shortcuts
ar: اختصارات الطرفية

# shortcut window
source: Search
ar: بحث

# shortcut window
source: Find text within terminal
ar: ايجاد نص ضمن الطرفية

source: Open File…
ar: افتح ملفًا…

source: Installing %u package
ar: تنصيب %u حزم

source: Failed to initialize language server: %s
ar: %s :فشل في تهيئة لغة المخدم

source: Destination file must be within the project tree.
ar: الملف المستهدف يجب أن يكون ضمن شجرة المشروع

source: File must be within the project tree.
ar: الملف يجب أن يكون ضمن شجرة المشروع

source: Could not parse XML from stream
ar: فضل تحليل XML من الدفق

source: _Go to Definition
ar: _اذهب للتعريف

source: _Find references
ar: _جِد مراجع

source: _Undo
ar: _تراجع

source: _Redo
ar: _أعد

source: C_ut
ar: _قص

source: _Copy
ar: ا_نسخ

source: _Paste
ar: أ_لصق

source: _Delete
ar: ا_حذف

source: _Highlighting
ar: ت_ظليل

source: _Selection
ar: ت_حديد

source: Select _All
ar: حدد ال_كل

source: Select _None
ar: أ_زل التحديد

source: All _Upper Case
ar: الكل لحالة الأحرف ال_كبيرة

source: All _Lower Case
ar: الكل لحالة الأحرف ال_صغيرة

source: _Invert Case
ar: ا_عكس حالة الأحرف

source: Invert Case
ar: اعكس حالة الأحرف

source: _Title Case
ar: حالة الع_نوان

source: _Join Lines
ar: ا_دمج الأسطر

source: Join Lines
ar: ادمج الأسطر

source: S_ort Lines
ar: _رتب الأسطر

source: Sort Lines
ar: رتب الأسطر

source: _Zoom
ar: _تكبير

source: Zoom
ar: تكبير

source: Zoom _In
ar: _قرّب

source: Zoom _Out
ar: _بعّد

source: _Reset
ar: ا_ستعد

source: Reset
ar: استعد

source: Insert “%s”
ar: احشر “%s”

source: Replace “%s” with “%s”
ar: بدل “%s” ب “%s”

source: Apply Fix-It
ar: تطبيق أصلحه

source: Rename symbol
ar: أعد تسمية الرمز

source: <b>%s</b> — <small>Line %u, Column %u</small>
ar: <b>%s</b> — <small>سطر %u, عمود %u</small>

source: No references were found
ar: لا يوجد مراجع

source: Close
ar: أغلق

source: _Open Link
ar: افتح راب_طًا

source: _Copy Link Address
ar: ا_نسخ عنوان الرابط

source: Selection
ar: تحديد

source: Failed to create shell within runtime “%s”
ar: فشل إنشاء shell ضمن نظام التنفيذ “%s”

source: Untitled Terminal
ar: طرفية غير معنونة

source: Save Terminal Content As
ar: احفظ محتويات الطرفية باسم

source: Untitled terminal
ar: طرفية غير معنونة

source: Exited
ar: خرج

source: Failed to launch subprocess. You may need to rebuild your project.
ar: فشل في تشغيل العملية الفرعية. ربما عليك إعادة بناء المشروع.

source: Subprocess launcher failed too quickly, will not respawn.
ar: فشل مشغل العمليات الفرعية بسرعة؛ لن يُعاد توليده.

source: Search runtimes
ar: ابحث ضمن نظام التنفيذ

source: Regex
ar: التعبيرات النمطية

source: Match whole word
ar: طابق الكلمات الكاملة

source: Wrap around
ar: التفاف

source: (Empty)
ar: (فارغ)

source: Loading…
ar: تحميل…

source: unversioned
ar: غير مرقم

source: Run a new instance of Alwarsha
ar: شغل نسخة إضافية من الورشة

source: Building cache…
ar: إنشاء الذاكرة المخبئية…

source: Bootstrapping build system
ar: تمهيد نظام البناء

source: Configuring project
ar: إعداد المشروع

source: Building project
ar: بناء المشروع

source: Caching build commands
ar: التخزين المؤقت لأوامر البناء

source: Beautifier plugin: error copying the gresource config file for “%s”: %s
ar: الإضافة Beautifier: خطأ في نسخ ملف إعداد gresource لـ“%s”: %s

source: Beautifier plugin: error creating temporary config file for “%s”
ar: الإضافة Beautifier: فشل إنشاء ملف إعدادات مؤقت لـ“%s”

source: Beautifier plugin: Can’t read .ini file: %s
ar: الإضافة Beautifier: لا يمكن قراءة ملف .ini: %s

source: Beautifier plugin: neither command nor command-pattern keys found: entry “%s” disabled
ar: الإضافة Beautifier: لم يُعثر على مفاتيح الأمر أو نمط الأمر: المدخلة “%s” معطلة

source: Beautifier plugin: both command and command-pattern keys found: entry “%s” disabled
ar: الإضافة Beautifier: عثر على مفاتيح الأمر ونمط الأمر: المدخلة “%s” معطلة

source: Beautifier plugin: config path “%s” does not exist, entry “%s” disabled
ar: الإضافة Beautifier: مسار ملف الإعدادات “%s” غير موجود، عُطلت المدخلة “%s”

source: Beautifier plugin: command key out of possible values: entry “%s” disabled
ar: الإضافة Beautifier: مفتاح الأمر خارج نطاق القيم المتاحة: عُطلت المدخلة “%s”

source: Beautifier plugin: can’t create temporary file for “%s”: entry “%s” disabled
ar: الإضافة Beautifier: فشل إنشاء ملف مؤقت لـ“%s”: عُطلت المدخلة “%s”

source: Beautifier plugin: “%s”
ar: الإضافة Beautifier: “%s”

source: Beautifier plugin: %s
ar: الإضافة Beautifier: %s

source: Beautifier plugin: can’t read the following resource file: “%s”
ar: الإضافة Beautifier: فشلت قراءة ملف الموارد: “%s”

source: beautifier program missing, you must install it:
ar: ملف beautifier التنفيذي مفقود؛ عليك تنصيبه:

source: Beautifier Plugin: the view is not a GtkSourceView
ar: الإضافة Beautifier: نافذة العرض ليست من صنف GtkSourceView

source: Beautifier Plugin: no default beautifier found
ar: الإضافة Beautifier: لم يُعثر على أمر beautifier افتراضي

source: Beautifier Plugin: the buffer is not writable
ar: الإضافة Beautifier: الصوان غير قابل للتعديل

source: Beautifier Plugin: Nothing selected
ar: الإضافة Beautifier: لا شيء محدد

source: No beautifier available for “%s”
ar: لا أمر beautifier متوفر لـ“%s”

source: No beautifier available
ar: أمر beautifier غير متوفر

source: Editing
ar: تحرير

source: Beautify the code
ar: تجميل الشفرة المصدرية

source: Trigger the default entry
ar: أثِر المدخلة الافتراضية

source: Beautifier plugin: no valid entries, disabling: %s
ar: الإضافة Beautifier: لا مدخلة صالحة، تعطيل: %s

source: Beautifier plugin: blocked attempt to remove a file outside of the “%s” temporary directory: “%s”
ar: الإضافة Beautifier: مُنعت محاولة إزالة ملف خارج مجلد “%s” المؤقت: “%s”

source: Beautifier plugin: command error output: %s
ar: الإضافة Beautifier: ناتج خطأ تنفيذ الأمر: %s

source: Beautifier plugin: the command output is empty
ar: الإضافة Beautifier: ناتج الأمر فارغ

source: Beautify plugin: the output is not a valid UTF-8 text
ar: الإضافة Beautifier: ناتج الأمر ليس نصًا بترميز UTF-8 صحيح

source: _Beautify
ar: ت_جميل

source: Beautify
ar: تجميل

source: %s (Copy)
ar: %s (نسخ)

source: No build configuration
ar: لا يوجد تكوين بناء

source: Select a build configuration from the sidebar to modify.
ar: اختر تكوين بناء من الشريط الجانبي لتعديله.

source: Build Configurations
ar: تكوين البناء

source: All Runtimes
ar: كل أنظمة التنفيذ

source: Make _Active
ar: ن_شط

source: Select this configuration as the active configuration.
ar: حدد هذا التكوين على أنه التكوين المفعل

source: _Duplicate
ar: كرر_

source: Duplicating the configuration allows making changes without modifying this configuration.
ar: تكرار التكوين يسمح بعمل تغييرات دون التأثير على هذا التكوين.

source: _Remove
ar: _أزل

source: Removes the configuration and cannot be undone.
ar: يزيل التكوين ولا يمكن التراجع عن ذلك.

source: Environment
ar: بيئة

source: Overview
ar: لمحة عامة

source: Build Environment
ar: بيئة البناء

source: Runtime Environment
ar: بيئة نظام التنفيذ

source: Name
ar: اسم

source: Source Directory
ar: المجلد المصدر

source: Build System
ar: نظام البناء

source: Install Prefix
ar: بادئة موقع التنصيب

source: Configure Options
ar: تكوين الخيارات

source: Application Runtime
ar: نظام تنفيذ التطبيق

source: Build Toolchain
ar: مجموعة أدوات البناء

source: _Save
ar: _احفظ

source: Build Output
ar: ناتج البناء

source: Clear build log
ar: احذف سجل البناء

source: Cancel build
ar: ألغ البناء

source: Save build log
ar: احفظ سجل البناء

source: Missing
ar: مفقود

source: Update project dependencies
ar: حدث اعتماديات المشروع

source: Configure build preferences
ar: كوّن تفضيلات البناء

source: Build Profile
ar: هيئة البناء

source: Runtime
ar: نظام التنفيذ

source: Device
ar: جهاز

source: There is a problem with the current build configuration.
ar: يوجد مشكلة في تكوين البناء الحالي

source: Build status
ar: حالة البناء

source: View build console contents
ar: اعرض محتويات طرفية البناء

source: Last build
ar: آخر بناء

source: Build result
ar: ناتج البناء

source: Errors
ar: أخطاء

source: Warnings
ar: تحذيرات

source: True
ar: صحيح

source: _Build
ar: _بناء

source: _Rebuild
ar: إ_عادة بناء

source: _Clean
ar: تن_ظيف

source: _Export Bundle
ar: _صدر حزمة

source: Build Issues
ar: مشاكل البناء

source: Build status:
ar: حالة البناء:

source: Time completed:
ar: وقت الإكمال:

source: Build Details
ar: تفاصيل البناء

source: Build pipeline is empty
ar: خط البناء فارغ

source: Build Targets
ar: مستهدفات البناء

source: Build Preferences
ar: تفضيلات البناء

source: R_ebuild
ar: أع_د البناء

source: _Run
ar: _نفذ

source: R_un With…
ar: ن_فذ باستخدام…

source: Run With…
ar: نفذ باستخدام…

source: Show errors and warnings provided by Clang
ar: أظهر الأخطاء والتحذيرات المستلمة من Clang

source: clang diagnostics warnings errors
ar: clang diagnostics warnings errors أخطاء تحذيرات تشخيصات

source: Suggest completions using Clang
ar: اقترح الإكمالات باستخدام Clang

source: Use Clang to suggest completions for C and C++ languages
ar: استخدم Clang لاقتراح الإكمالات للغتي سي و سي++

source: Clang Options
ar: خيارات Clang

source: Complete Parenthesis
ar: اكمال الأقواس

source: Include parenthesis when completing clang proposals
ar: ضمّن الأقواس عند استكمال مقترحات Clang

source: Complete Parameters
ar: أكمل المعطيات

source: Include parameters and types when completing clang proposals
ar: تضمين المعطيات والأصناف عند الإكمال بمقترحات Clang

source: anonymous
ar: مجهول

source: Complete parentheses
ar: أكمل الأقواس

source: If parentheses should be included when completing.
ar: وجوب تضمين الأقواس عند الإكمال.

source: Complete parameters
ar: أكمل المعطيات

source: If parameters should be included when completing. Requires complete-parentheses.
ar: وجوب تضمين المعطيات عند الإكمال. تتطلب `أكمل المعطيات`.

source: Configure project
ar: كوّن المشروع
