Repository: Alusus/Alwarsha
Catalog: po/*.po
Languages: ar

source: Alwarsha
ar: الورشة

source: An IDE with support for Alusus Language
ar: محرر لتطوير البرمجيات مع دعم للغة الاسس

source: Builder is an actively developed Integrated Development Environment for GNOME. It combines integrated support for essential GNOME technologies such as GTK+, GLib, and GNOME APIs with features that any developer will appreciate, like syntax highlighting and snippets.
ar: الباني هو بيئة تطوير متكاملة تم تطويرها من اجل جنوم فهو يدعم بشكل كامل تقنيات جنوم الاساسيةمع ميزات اساسية لاي مطور كالاكمال التلقائي وتلوين قواعد اللغة.

source: You can rely on predictable releases of Builder with each new release of GNOME every six months.
ar: يمكنك توقع اصدار جديد من الباني مع كل اصدار جديد من جنوم كل ستة اشهر

source: Features:
ar: :الميزات

source: Built in syntax highlighting for many languages
ar: تلوين تلقائي لكثير من اللغات المعروفة

source: Side-by-side code editors
ar: تحرير ملفات برمجية متعددة جنبا إلى جنب

source: Multi-monitor support
ar: دعم تعددية الشاشات

source: Code overview mini-map
ar: خريطة مصغرة للكود

source: Integration with Git
ar: TODO: التكامل مع Git

source: Integration with Autotools, Cargo, CMake, Gradle, Meson, Maven, Make, PHPize, and Waf
ar: TODO: التكامل مع Autotools و Cargo و CMake و Gradle و Meson و Maven و Make وPHPize و Waf

source: Clang based auto-completion, semantic highlighting, and diagnostics
ar: الإكمال التلقائي والتظليل الدلالي والتشخيصات لClang

source: Python based auto-completion, semantic highlighting, and diagnostics
ar: الإكمال التلقائي والتظليل الدلالي والتشخيصات لبايثون

source: Vala based auto-completion and diagnostics
ar: الإكمال التلقائي والتشخيصات للغة ڤالا

source: Auto indentation support for C, Python, Vala, and XML
ar: C و Python و Vala و XMLدعم التنسيق التلقائي ل

source: HTML, Markdown, and reStructuredText, and Sphinx live preview
ar: HTML و Markdown و reStructuredText و Sphinx دعم العرض المباشر ل

source: Optional Vim, Emacs, and SublimeText style editing
ar: Vim و Emacs و SublimeTextنمط تحرير اختياري ل

source: An integrated software profiler for native applications
ar: محلل أداء ضمني للبرمجيات الأصلية

source: An integrated debugger for native applications
ar: تنقيح متكامل للبرمجيات الأصلية

source: Support for building with jhbuild and flatpak runtimes
ar: jhbuild و flatpak دعم للبناء باستخدام

source: Support for viewing TODOs found within your code base
ar: ضمن الكود الخاص بك TODO دعم لعرض

source: Fast fuzzy text search across files and symbols
ar: بحث سريع عبر الملفات والرموز

source: Quickly access your projects
ar: دخول سريع لمشاريعك

source: Create new projects from a variety of templates
ar: أنشئ مشاريع جديدة بالاختيار من بين العديد من القوالب

source: Integration with Git to clone your projects
ar: لتنزيل مشاريعك git تكامل مع

source: The source code editor
ar: محرر الشيفرة المصدرية

source: Fast global fuzzy search
ar: بحث مرن عام سريع

source: Debug with the GNU debugger
ar: GNU تنقيح باستخدام منقح

source: Build Parallelism
ar: البناء على التوازي

source: Number of workers to use when performing builds. -1 for sensible default. 0 for number of CPU.
ar: عدد العمليات المستخدمة عند البناء . -1 للاختيار التلقائي. 0لتطابق عدد معالجات النظام.

source: Allow network when metered
ar: السماح بالاتصال بالشبكات المكلفة

source: Enable automated transfers upon building such as SDK downloads and dependencies when connection is metered.
ar: SDK السماح بالنقل التلقائي أثناء البناء مثل تحميلات والاعتماديات عندما يكون الاتصال مكلفا.

source: Debugger Breakpoint on Main
ar: نقطة توقف للمنقح في الدالة الرئيسية

source: Debugger should automatically insert breakpoint on main function.
ar: يجب على المنقح إدخال نقطة توقف تلقائيًا عند الدالة الرئيسية.

source: Ctags based autocompletion
ar: إكمال تلقائي مبني على ctags

source: Use Ctags for autocompletion.
ar: استخدم ctags للإكمال التلقائي.

source: Enable semantic highlighting
ar: تمكين التمييز الدلالي

source: If enabled, additional highlighting will be provided in supported languages based on information extracted from the source code.
ar: عند التفعيل ستُوفر تمييزات اضافية في اللغات المدعومةبناءًا على معلومات مستخرجة من الشفرة المصدرية.

source: Path to ctags executable
ar: مسار ملف ctags التنفيذي

source: The path to the ctags executable on the system.
ar: مسار ملف ctags التنفيذي في نظام الملفات.

source: Restore last position
ar: استعد اخر موقع

source: Jump to the last position when reopening a file
ar: الذهاب للموقع السابق عند إعادة فتح ملف

source: Show modified lines
ar: إظهار الأسطر المعدلة

source: If enabled, the editor will show line additions and changes next to the source code.
ar: عند التفعيل سيعرض المحرر الإضافات والتغيرات في الأسطر على جانب الشفرة المصدرية.

source: Show diagnostics next to line number
ar: أظهر التشيخصات على جانب رقم السطر

source: If enabled, the editor will show diagnostics to the left to the line numbers.
ar: عند التفعيل سيعرض المحرر التشخيصات على جانب أرقام الأسطر

source: Highlight current line
ar: ظلل سطر المؤشر

source: If enabled, the editor will highlight the line containing the cursor.
ar: عند التفعيل سيظلل المحرر السطر الذي يحتوي على المؤشر.

source: Highlight matching brackets
ar: ظلل الأقواس المتوافقة

source: If enabled, the editor will highlight matching brackets.
ar: عند التفعيل سيظلل المحرر الأقواس المتوافقة

source: Show line numbers
ar: أظهر أرقام الأسطر

source: If enabled, the editor will show line numbers.
ar: عند التفعيل سيظهر المحرر أرقام الأسطر

source: Show relative line numbers
ar: أظهر أرقام الأسطر النسبية

source: If enabled, the editor will show relative line numbers.
ar: عند التفعيل سيظهر المحرر أرقام الأسطر النسبية.

source: Smart Backspace
ar: المحو الخلفي الذكي

source: Backspace will remove additional spaces to keep you aligned to the indentation size.
ar: زر المحو سيزيل مسافات إضافية لإبقائك متسقا مع المسافة البادئة

source: Smart Home and End
ar: أزرار بداية ونهاية ذكية

source: Whether or not Home moves to first non-space character.
ar: تحديد ما إذا كان زر البداية (Home) ينقلك لأول محرف غير المسافات.

source: Show grid lines
ar: أظهر خطوط الشبكة

source: If enabled, the editor will show grid lines in the document.
ar: عند التفعيل سيعرض المحرر خطوط الشبكة في المستند

source: Show overview map
ar: أظهر النافذة الموجزة

source: If enabled, Builder will display an overview map of the source file next to the editor.
ar: عند التمكين سيظهر الباني خارطة موجزة من الملف المصدر بجانب المحرر.

source: Automatically Hide Overview Map
ar: أخفِ الخارطة الموجزة تلقائيًا

source: If enabled, Builder will automatically hide the overview map when mouse focus leaves the editor, or a timeout occurs.
ar: عند التفعيل سيقوم الباني تلقائيًا بإخفاء الخارطة الموجزة عندما يغادر تركيز الفأرة المحرر أو ينتهي الوقت المحدد.

source: Draw Spaces
ar: رسم المسافات

source: The various types of space to draw in the editor.
ar: الأنواع المختلفة من المسافات لرسمها في المحرر

source: Overscroll
ar: التمرير الزائد

source: The number of lines to scroll beyond the end of the buffer.
ar: عدد الأسطر المراد تمريرها بعد نهاية الصوان

source: Wrap Text
ar: التفاف النص

source: If enabled, Builder will automatically wrap text so all of the line text is visible.
ar: عند التفعيل سيقوم الباني تلقائيًا بلف النصوص بحيث يكون محتوى السطر مرئيًا بالكامل.

source: Autosave Enabled
ar: تفعيل الحفظ التلقائي

source: Enable or disable autosave feature.
ar: تفعيل أو إيقاف خاصية الحفظ التلقائي.

source: Autosave Frequency
ar: تردد الحفظ التلقائي

source: The number of seconds after modification before auto saving.
ar: عدد الثواني ما بين التعديل والحفظ التلقائي.

source: Completion Row Count
ar: عدد أسطر الإكمال

source: The number of completion rows to display to the user.
ar: عدد أسطر الإكمال المراد إظهارها للمستخدم

source: Line Spacing
ar: المسافة ما بين الأسطر

source: The number of pixels to include above and below lines in the editor.
ar: عدد البكسلات لتضمينها فوق وأسفل الأسطر في المحرر.

source: Interactive Completion
ar: الإكمال التفاعلي

source: If enabled, Builder will automatically display completion proposals as you type.
ar: عند التفعيل سيقوم الباني بتقديم اقتراحات الإكمال بشكل تلقائي أثناء الكتابة.

source: Spaces Style
ar: نسق المسافات

source: How to apply spaces when reformatting text.
ar: كيفية تطبيق المسافات عند إعادة تنسيق النص.

source: Enabled
ar: مفعلة

source: If the type within the extension is enabled.
ar: إذا كان الصنف ضمن الإضافة مفعلاً.

source: Window size
ar: حجم النافذة

source: Window size (width and height).
ar: (العرض والارتفاع) حجم النافذة

source: Window position
ar: موضع النافذة

source: Window position (x and y).
ar: (س و ص) موضع النافذة

source: Window maximized
ar: النافذة مكبرة

source: Window maximized state
ar: حالة النافذة المكبرة

source: Night Mode
ar: الوضع الليلي

source: Prefer dark application chrome.
ar: تفضيل تطبيق وضع كروم المظلم

source: Follow system night light
ar: اتبع الإنارة الليلية للنظام

source: Use GNOME night light setting to activate night-mode.
ar: استخدم إعدادات جنوم للإضاءة الليلية لتفعيل الوضع الليلي

source: Projects directory
ar: مجلد المشاريع

source: Directory for all Alwarsha projects.
ar: مجلد لكل مشاريع الورشة.

source: Restore Previous Files
ar: استعد الملفات السابقة

source: Restore previously opened files when loading a project.
ar: استعد الملفات المفتوحة مسبقاً عند تحميل المشروع

source: Show Open Files
ar: أظهر الملفات المفتوحة

source: Display the open files list in the project sidebar.
ar: أظهر قائمة الملفات المفتوحة في اللوحة الجانبية للمشروع

source: Clear build caches at startup
ar: نظف ملفات البناء المؤقتة عند التشغيل

source: If enabled, Alwarsha will clear build caches upon startup.
ar: عند التفعيل ستقوم الورشة بتنظيف ملفات البناء المؤقتة عند التشغيل

source: Plugin enabled
ar: الإضافة مفعلة

source: If the plugin should be enabled
ar: إذا ما توجب تفعيل الإضافة

source: Show Icons
ar: أظهر الأيقونات

source: This setting is deprecated and no longer in use.
ar: هذا الإعداد ملغى وما عاد يستخدم.

source: Show Ignored Files
ar: أظهر الملفات المتجاهلة

source: If enabled, the project tree will display files that are ignored by the VCS.
ar: عند التفعيل ستُعرض الملفات المتجاهلة من قبل مدير الشفرة المصدرية (VCS) في شجرة المشروع.

source: Sort Directories First
ar: رتب المجلدات أولاً

source: If enabled, the project tree will sort directories before regular files.
ar: عند التفعيل ستُعرض المجلدات أولاً ثم الملفات في شجرة المشروع.

source: Selected configuration for building
ar: الإعدادات المختارة للبناء

source: The configuration that has been selected and will be restored the next time the project loads.
ar: الإعدادات المختارة والتي ستُستعاد في المرة القادمة التي يُحمل فيها المشروع.

source: Show Left Panel
ar: أظهر اللوحة اليسرى

source: If enabled, the left panel will be displayed.
ar: عند التفعيل ستظهر اللوحة اليسرى.

source: Left Panel Position
ar: موقع اللوحة اليسرى

source: The width in pixel units of the left panel.
ar: العرض بالبكسل للوحة اليسرى

source: Show Right Panel
ar: أظهر اللوحة اليمنى

source: If enabled, the right panel will be displayed.
ar: عند التفعيل ستُعرض اللوحة اليمنى.

source: Right Panel Position
ar: موقع اللوحة اليمنى

source: The width in pixel units of the right panel.
ar: العرض بالبكسل للوحة اليمنى

source: Show Bottom Panel
ar: أظهر اللوحة السفلى

source: If enabled, the bottom panel will be displayed.
ar: عند التفعيل ستُعرض اللوحة السفلى.

source: Bottom Panel Position
ar: موقع اللوحة السفلى

source: The height in pixel units of the bottom panel.
ar: الارتفاع بالبكسل للوحة السفلى

source: Build software using Alusus Language
ar: طوّر برامجًا باستخدام لغة الأسس

source: Build;Develop;
ar: بناء;تطوير;

source: Open a Project
ar: افتح مشروعًا

source: Start New Project
ar: ابدأ مشروعًا جديدًا

source: Clone Repository
ar: انسخ مستودعًا

source: New Editor Workspace
ar: مساحة عمل جديدة للمحرر

source: D-Bus Inspector
ar: D-Bus متفقد

source: Adwaita Dark
ar: Adwaita داكن

source: The default color scheme for TextEditor
ar: المخطط اللوني الافتراضي لمحرر النصوص

source: Builder Dark
ar: الباني داكن

source: Dark color scheme for Builder using the Tango color palette
ar: مخطط لوني داكن للباني باستخدام لوحة ألوان تانجو

source: The default color scheme for Builder
ar: المخطط اللوني الافتراضي للباني

source: Basic
ar: أساسيات

source: Palette:
ar: لوحة الألوان:

source: Palette
ar: لوحة الألوان

source: Color Plane
ar: المستوى اللوني

source: Color name
ar: اسم اللون

source: Enter a new name for the color
ar: أدخل اسمًا جديدًا للون

source: Unsaved palette %u
ar: غير محفوظة %u لوحة الألوان

source: failed to parse line %i
ar: %i فشل في تحليل السطر

source: %s: palette is empty
ar: %s: لوحة الألوان فارغة

source: %s: failed to parse
ar: %s: فشل التحليل

source: Unable to open %s
ar: فشل فتح %s

source: %s: This file format is not supported
ar: %s: صيغة هذا الملف غير مدعومة

source: failed to parse
ar: فشل التحليل

source: Generated
ar: مولّد

source: Unable to save %s
ar: فشل حفظ %s

source: Hue
ar: صبغة اللون

source: Saturation
ar: الإشباع

source: Value
ar: قيمة

source: Red
ar: أحمر

source: Green
ar: أخضر

source: Blue
ar: أزرق

source: Color Components
ar: مكونات اللون

source: Color strings
ar: سلاسل الألوان

source: Palettes
ar: لوحات الألوان

source: No open palettes
ar: لا لوحات ألوان مفتوحة

source: Load or generate a palette using the preferences
ar: تحميل او توليد لوحة ألوان باستخدام التفضيلات

source: Rename
ar: أعد التسمية

source: Remove
ar: احذف

source: _Rename
ar: _أعد التسمية

source: unsaved file %u
ar: ملف غير محفوظ %u

source: The current language lacks a symbol resolver.
ar: اللغة الحالية تفتقر لمحلل رموز.

source: %s contained invalid ASCII
ar: %s تحتوي على محارف غير صالحة

source: Failed to parse integer from “%s”
ar: فشل تحليل العدد الصحيح من “%s”

source: language defaults missing version in [global] group.
ar: الإعدادات الافتراضية الخاصة باللغة تفتقر لرقم الإصدار في المجموعة العامة.

source: Failed to initialize defaults.
ar: فشل في تهيئة الإعدادات الافتراضة.

source: Failed to save draft: %s
ar: فشل حفظ المسودة: %s

source: Untitled
ar: بدون عنوان

source: _Cancel
ar: _إلغاء

source: A suitable debugger was not found.
ar: لم يتم العثور على منقح مناسب.

source: Failed to load file: %s
ar: فشل تحميل الملف: %s

source: Print failed: %s
ar: فشلت الطباعة: %s

source: Failed to save file: %s
ar: فشل حفظ الملف: %s

source: Save File
ar: احفظ ملف

source: Save
ar: احفظ

source: Cancel
ar: ألغ

source: Save a Copy
ar: احفظ نسخة

source: Editor shortcuts
ar: اختصارات المحرر

source: Files
ar: الملفات

source: Save the document
ar: احفظ المستند

source: Save the document with a new name
ar: احفظ المستند باسم جديد

source: Print the document
ar: اطبع المستند

source: Find and replace
ar: ابحث واستبدل

source: Find
ar: ابحث

source: Move to the next match
ar: انتقل إلى التطابق التالي

source: Move to the previous match
ar: انتقل إلى التطابق السابق

source: Move to the next error
ar: انتقل إلى الخطأ التالي

source: Move to the previous error
ar: انتقل إلى الخطأ السابق

source: _Reload
ar: _أعد التحميل

source: Alwarsha has discovered that this file has been modified externally. Would you like to reload the file?
ar: استشعرت الورشة تعديلاً خارجيًا على هذا الملف. هل ترغب بإعادة تحميله؟

source: Regular expressions
ar: التعابير النمطية

source: Case sensitive
ar: حساس لحالة الأحرف

source: Match whole word only
ar: جد التطابق في كامل الكلمة فقط

source: %u of %u
ar: %u من %u

source: _Replace
ar: استبدل_

source: Replace
ar: استبدل

source: Replace _All
ar: استبدل ال_كل

source: Replace All
ar: استبدل الكل

source: Switch between Search and Search-and-Replace
ar: بدل ما بين البحث والبحث مع الاستبدال

source: Show or hide search options such as case sensitivity
ar: أظهر او اخفِ خيارات البحث مثل حساسية الاحروف

source: Regular _expressions
ar: التعابير _النمطية

source: _Case sensitive
ar: حساسية حالة الأحرف_

source: _Match whole word only
ar: طابق كامل الكلمة فقط_

source: Document Properties
ar: خصائص المستند

source: Highlight Mode
ar: وضع التظليل

source: General
ar: عام

source: Display line numbers
ar: أظهر أرقام الأسطر

source: Display relative line numbers
ar: أظهر أرقام الأسطر النسبية

source: Display right margin
ar: عرض الهامش الأيمن

source: Automatic indentation
ar: إزاحة تلقائية

source: Smart backspace
ar: محو ذكي

source: Enabling smart backspace will treat multiple spaces as a tabs
ar: تمكين المحو الذكي سيعامل عدة مسافات كمحرف TAB

source: Insert trailing newline
ar: أضف سطرًا جديدًا في ذيل المستند

source: Overwrite trailing braces and quotations
ar: اكتب فوق الأقواس وعلامات الاقتباس الزائدة

source: Indentation
ar: الإزاحة

source: Spaces
ar: المسافات

source: Spaces per tab
ar: عدد المسافات لكل TAB

source: Open Pages
ar: افتح صفحات

source: Open File
ar: افتح ملفًا

source: Open
ar: افتح

source: Create a new document
ar: أنشئ مستندًا جديدًا

source: Open a document
ar: افتح مستندًا

source: Panels
ar: لوحات

source: Toggle navigation panel
ar: تبديل لوحة التصفح

source: Toggle utilities panel
ar: تبديل لوحة الأدوات

source: Close all files
ar: أغلق جميع الملفات

source: Editor
ar: المحرر

source: Restoring previous session
ar: استعد الجلسة السابقة

source: Your previous session will be ready in a moment.
ar: جسلتك السابقة ستكون جاهزة خلال لحظات

source: Switch surface
ar: غير السطح

source: Search your project
ar: ابحث ضمن مشروعك

source: Failed to initialize build pipeline: %s
ar: فشلت تهيئة خط البناء: %s

source: Failed to get device information: %s
ar: فشل الحصول على بيانات الجهاز: %s

source: Discovered device “%s”
ar: أكتُشف الجهاز “%s”

source: Devices
ar: الأجهزة

source: Cannot deploy to device, build pipeline is not initialized
ar: لا يمكن النشر إلى الجهاز، خط البناء غير مهيأ

source: Fallback
ar: الخطة البديلة

source: My Computer (%s)
ar: حاسوبي (%s)

source: My Computer (%s) — %s
ar: حاسوبي (%s) — %s

source: The build pipeline is in a failed state
ar: خط البناء في حالة فشل

source: The build configuration has errors
ar: إعدادات البناء فيها أخطاء

source: Pseudo terminal creation failed. Terminal features will be limited.
ar: فشل إنشاء طرفية مستعارة. خصائص الطرفية ستكون محدودة.

source: Cleaning…
ar: ...تنظيف

source: Failed
ar: فشل

source: Ready
ar: جاهز

source: Downloading…
ar: ينزل...

source: Building dependencies…
ar: اعتماديات البناء...

source: Bootstrapping…
ar: التمهيد...

source: Configuring…
ar: الإعداد...

source: Building…
ar: بناء...

source: Installing…
ar: تنصيب...

source: Committing…
ar: ارتكاب...

source: Exporting…
ar: تصدير...

source: Success
ar: نجح

source: Preparing…
ar: تحضير...

source: Cannot build transfer while on metered connection
ar: لا يمكن بناء نقل عند استخدام اتصال مكلف

source: Cannot run target, another target is running
ar: لا يمكن تشغيل الهدف، هناك هدف اخر قيد التشغيل

source: Failed to locate runtime
ar: فشل في إيجاد نظام التنفيذ

source: Running %s…
ar: تشغيل %s...

source: The build target failed to build: %s
ar: فشل بناء الهدف: %s

source: Workbench shortcuts
ar: اختصارات منضدة العمل

source: Build and Run
ar: بناء وتشغيل

source: Failed to locate a build target
ar: فشل في إيجاد هدف للبناء

source: Run
ar: شغل

source: Process quit unexpectedly
ar: انتهت العملية بشكل غير متوقع

source: Host Operating System
ar: نظام التشغيل المضيف

source: Host System
ar: النظام المضيف

source: Default (Host operating system)
ar: الافتراضي (نظام التشغيل المضيف)

source: The directory “%s” already exists. Please choose another directory.
ar: المجلد “%s” موجود مسبقًا. اختر مجلدًا آخر رجاءًا.

source: Your project will be created at %s
ar: سيتم إنشاء مشروعك في %s

source: Repository URL
ar: مسار المستودع

source: Enter the repository of the project you would like to clone. The URL should look similar to “https://gitlab.gnome.org/GNOME/gnome-builder.git”.
ar: أدخل مسار المستودع للمشروع الذي تحب نسخه. يجب أن يكون المسار “https://gitlab.gnome.org/GNOME/gnome-builder.git” مشابهًا لـ

source: Select branch and other options.
ar: حدد الفرع والخيارات الاخرة

source: Repository Kind
ar: نوع المستودع

source: Branch
ar: فرع

source: Author Name
ar: اسم المالك

source: Author Email
ar: إيميل المالك

source: Project Destination
ar: مسار المشروع

source: Clone _Project
ar: نسخ _المشروع

source: Clone Project
ar: نسخ المشروع

source: Select a _Folder…
ar: اختر _مجلدًا…

source: _Clone Repository…
ar: _إنسخ المستودع…

source: Directory
ar: مجلد

source: Select Project Folder
ar: اختر مجلد المشروع

source: Select Project File
ar: اختر ملف المشروع

source: _Open
ar: _افتح

source: All Project Types
ar: كل أنواع المشاريع

source: Alwarsha — %s
ar: الورشة — %s

source: Failed to load the project
ar: فشل تحميل المشروع

source: Removing project sources will delete them from your computer and cannot be undone.
ar: إزالة مصادر المشروع سيؤدي لحذفها من حاسوبك ولن تتمكن منالتراجع.

source: Delete Project Sources
ar: احذف مصادر المشروع

source: Go back
ar: عد للخلف

# title
source: Open a Project
ar: افتح مشروعًا

source: Search all Builder projects…
ar: ابحث في كل مشاريع الباني…

source: No Projects Found
ar: لم يجد مشاريعًا

source: _Remove Projects
ar: _أزل المشاريع

source: Remove Projects and Sources…
ar: أزل المشاريع والمصادر…

# title
source: Clone Repository
ar: انسخ المستودع

source: Switch Surface
ar: بدل السطح

source: Close Project
ar: أغلق المشروع

source: Preferences
ar: التفضيلات

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح

source: Help
ar: مساعدة

source: About Alwarsha
ar: عن الورشة

source: _Quit
ar: _اخرج

source: Run Options
ar: خيارات التنفيذ

source: Alwarsha — Preferences
ar: الورشة — تفضيلات

source: translator-credits
ar: Sleman Alrstum <sleman.alrstum231@gmail.com>

source: Learn more about Alwarsha
ar: تعلم المزيد عن الورشة

source: Funded By
ar: ممول من

source: Show the application preferences
ar: أظهر تفضيلات التطبيق

source: Open project in new workbench
ar: افتح المشروع في منضدة جديدة

source: FILE
ar: ملف

source: Print version information and exit
ar: اطبع معلومات الإصدار واخرج

source: Increase log verbosity
ar: زيادة إسهاب السجل

source: Failed to open project: %s
ar: فشل فتح المشروع: %s

source: Show the help window
ar: أظهر نافذة المساعدة

source: Show the preferences window
ar: أظهر نافذة التفضيلات

source: Show the shortcuts window
ar: أظهر نافذة الاختصارات

source: Alwarsha requires a session with D-Bus which was not found. Please set DBUS_SESSION_BUS_ADDRESS. Some features may not be available.
ar: باني جنوم يتطلب جلسة مع D-Bus لكنها غير موجودة. يرجى تحديد قيمة لـDBUS_SESSION_BUS_ADDRESS. بعض الميزات قد لاتكون متاحة.

source: Command failed
ar: فشل الأمر

source: Failed to locate command “%s”
ar: فشل العثور على الأمر “%s”

source: Remove environment variable
ar: احذف متغيرًا محيطيًا

source: New variable…
ar: متغير جديد

source: Open a File or Terminal
ar: افتح ملفًا أو طرفية

source: Use the page switcher above or use one of the following:
ar: استخدم مبدل الصفحات أعلاه أو استخدم واحدًا من التالي:

source: Search
ar: ابحث

source: Project sidebar
ar: الشريط الجانبي للمشروع

source: File chooser
ar: منتقي الملفات

source: New terminal
ar: طرفية جديدة

source: _Open File…
ar: _افتح ملفًا…

source: _New Terminal
ar: _طرفية جديدة

source: New Terminal
ar: طرفية جديدة

source: Move document to the right
ar: انقل المستند إلى اليمين

source: Move document to the left
ar: انقل المستند إلى اليسار

source: Switch to the previous document
ar: بدل إلى المستند السابق

source: Switch to the next document
ar: بدل إلى المستند التالي

source: Close the document
ar: أغلق المستند

source: No Open Pages
ar: لا صفحات مفتوحة

source: Uh oh, something went wrong
ar: حدث خطأ ما

source: There was a failure while trying to perform the operation.
ar: حدث خطأ أثناء إجراء العملية.

source: Window shortcuts
ar: اختصارات النافذة

source: Show window menu
ar: أظهر قائمة النافذة

source: Toggle window to fullscreen
ar: حول النافذة لشاشة كاملة

source: Cannot load HTML. Missing WebKit support.
ar: لا يمكن تحميل HTML. دعم WebKit مفقود.

source: Extensions
ar: إضافات

source: Appearance
ar: المظهر

source: Themes
ar: السمات

source: Dark Mode
ar: الوضع الداكن
