Repository: Alusus/Alwarsha
Catalog: po/*.po
Languages: ar

source: Project Tree
ar: شجرة المشروع

source: Rename %s
ar: إعادة تسمية %s

source: New Fil_e…
ar: ملف جد_يد…

source: New File…
ar: ملف جديد…

source: New F_older…
ar: مجلد ج_ديد…

source: New Folder…
ar: مجلد جديد…

source: O_pen
ar: اف_تح

source: Open _With…
ar: افتح _باستخدام…

source: Open With…
ar: افتح باستخدام…

source: _Source Code Editor
ar: محرر ال_شفرة المصدرية

source: Source Code Editor
ar: محرر الشفرة المصدرية

source: Open _Containing Folder
ar: افتح المجلد ال_حاوي

source: Open in _Terminal
ar: افتح في ال_طرفية

source: Open in Terminal
ar: افتح في الطرفية

source: _Move to Trash
ar: انقل إلى _سلة المهملات

source: Move to Trash
ar: انقل إلى سلة المهملات

source: _Display Options
ar: _خيارات العرض

source: Display Options
ar: _خيارات العرض

source: S_how Ignored Files
ar: أ_ظهر الملفات المتجاهلة

source: S_ort Directories First
ar: _رتب المجلدات في المقدمة

source: Reveal in Project Tree
ar: اكشف في شجرة المشروع

source: Reveal File in Project _Tree
ar: اكشف ملفًا في _شجرة المشروع

source: Aarch64 Emulation
ar: محاكي Aarch64

source: Arm Emulation
ar: محاكي Arm

source: My Computer (%s) %s
ar: حاسوبي (%s) %s

source: Words matching selection
ar: الكلمات المطابقة للتحديد

source: Highlight all occurrences of words matching the current selection
ar: تظليل كل الظهورات للكلمات التي توافق التحديد الحالي

source: quick highlight words matching current selection
ar: تظليل سريع للكلمات التي توافق التحديد الحالي

source: Removing %s
ar: إزالة %s

source: Removing Files…
ar: ازالة الملفات…

source: _Close
ar: أ_غلق

source: Recent Projects
ar: آخر المشاريع

source: _Reformat tabs
ar: أ_عد تنسيق علامات التبويب

source: Reformat tabs
ar: أعد تنسيق علامات التبويب

source: Rust Analyzer: Cargo command for diagnostics
ar: محلل Rust: أمر Cargo للتشخيص

source: the default cargo command
ar: أمر cargo الافتراضي

source: clippy adds additional lints to catch common mistakes but is in general slower
ar: clippy يضيف قوعد lint لإيجاد الأخطاء الشائعة لكنه أبطأ عمومًا

source: Shell command
ar: الأمر Shell

source: Cannot spawn terminal in runtime environment because build pipeline is not initialized
ar: لا يمكن توليد الطرفية في بيئة التنفيذ لعدم جاهزية خط البناء

source: Cannot spawn process because build pipeline is not yet available
ar: لا يمكن توليد العملية لعدم جاهزية خط البناء

source: Change Shortcut
ar: غير الاختصار

source: Title
ar: عنوان

source: Shell Command
ar: الأمر Shell

source: The command will be executed using a shell like “/bin/sh -c". You may use variable expansion like “$SHELL”. Both “$SRCDIR” and “$BUILDDIR” are automatically set for the command.
ar: سينفذ الأمر باستخدام shell مثل “/bin/sh -c”. يمكنك استخدام زرع المتغيرات مثل “$SHELL”. كلا المتغيرين “$SRCDIR” و “$BUILDDIR” يتم تعيينهما تلقائيًا.

source: Command Locality
ar: موضعية الأمر

source: On Host
ar: على المضيف

source: In Build Environment
ar: في بيئة البناء

source: In Runtime Environment
ar: في بيئة التنفيذ

source: If the directory is not an absolute-path, it will be relative to the source or build directory depending on the command locality.
ar: إن لم يكن المسار مطلقًا سيُعامل نسبة لمسار مجلد المصدر أو مجلد البناء اعتمادًا على موضعية الأمر

source: Close on Exit
ar: أغلق عند الخروج

source: If enabled, the terminal page will close after the command executes.
ar: عند التمكين ستُغلق الطرفية تلقائيًا بعد تنفيذ الأمر

source: Keyboard Shortcut
ar: اختصارات لوحة المفاتيح

source: Change
ar: غيّر

source: Delete Command
ar: أمر الحذف

source: Run in host environment
ar: شغّل في بيئة المضيف

source: Run in build environment
ar: شغّل في بيئة البناء

source: Run in runtime environment
ar: شغّل في بيئة التنفيذ

source: New command
ar: أمر جديد

source: Click + to add an external command
ar: انقر على + لإضافة أمر خارجي

source: External Commands
ar: أوامر خارجية

source: Command
ar: أمر

source: Failed to parse snippet “%s”
ar: فشل إعراب المقتطف “%s”

source: Suggest Completions from Snippets
ar: اقتراح إكمالات من المقتطفات

source: Use registered snippets to suggest completion proposals
ar: استخدم المقتطفات المسجلة لاقتراح الإكمالات

source: Spelling
ar: التهجئة

source: Show the spellchecker panel
ar: أظهر لوحة المصحح الإملائي

source: Failed to initialize spellchecking, disabling
ar: فشلت تهيئة التدقيق الإملائي، تعطيل

source: No language selected
ar: لم يتم اختيار لغة

source: No language set. Check your dictionary installation.
ar: لم يتم تعيين لغة. تحقق من تثبيت القاموس الخاص بك.

source: No suggestions
ar: لا اقتراحات

source: Completed spell checking
ar: اكتمل التدقيق الإملائي

source: The word is not in the dictionary
ar: الكلمة ليست في القاموس

source: This word is already in the personal dictionary
ar: هذه الكلمة موجودة فعلاً في القاموس الشخصي

source: This word is already in the %s dictionary
ar: هذه الكلمة موجودة فعلاً في القاموس %s

source: Misspelled
ar: خطأ في التهجئة

source: _Ignore
ar: ت_جاهل

source: Ignore _All
ar: تجاهل ال_كل

source: Change _to
ar: غيّر إ_لى

source: Cha_nge
ar: _غيّر

source: Change A_ll
ar: غيّر ال_كل

source: _Suggestions
ar: ا_قتراحات

source: Add Word
ar: أضف كلمة

source: A_dd
ar: أ_ضف

source: Dictionary
ar: القاموس

source: _Language
ar: ال_لغة

source: Check _Spelling
ar: تحقق من الت_هجئة

source: _Underline misspelled words
ar: س_طّر الكلمات الخاطئة إملائيًا

source: Underline misspelled words
ar: سطّر الكلمات الخاطئة إملائيًا

source: Enable Stylelint
ar: مكّن Stylelint

source: Enable the use of stylelint to find additional diagnostics in stylesheet files. This may result in the execution of code in your project.
ar: تمكين استخدام Stylelint للعثور على تشخيصات في ملفات stylesheet. قد يؤدي هذا إلى تنفيذ شفرة في مشروعك.

source: Enable the use of Stylelint, which may execute code in your project
ar: الذي يمكن أن ينفذ شفرة في مشروعك Stylelint تمكين استخدام

source: stylelint stylesheet lint code execute execution
ar: stylelint stylesheet lint code execute execution كود شفرة تنفيذ نفذ لينت

source: Sublime Text
ar: محرر Sublime

source: Emulates the Sublime Text editor
ar: محاكاة محرر نصوص Sublime

source: Generate Support Log
ar: توليد سجل الدعم

source: The support log file has been written to “%s”. Please provide this file as an attachment on your bug report or support request.
ar: كُتب سجل الدعم على “%s”. يُرجى تقديم هذا الملف كملحق عند تقديم طلب دعم أو تقرير علة.

source: Symbols
ar: الرموز

source: Search symbols within document
ar: ابحث عن الرموز ضمن المستند

source: Unnamed Symbol
ar: رمز بدون اسم

source: Symbol
ar: رمز

source: _Select Symbol…
ar: ا_ختر رمزًا…

source: Document Outline
ar: موجز المستند

source: _Document Outline
ar: _موجز المستند

source: Profiler
ar: محلل الأداء

source: Open Sysprof Capture…
ar: افتح لقطة Sysprof…

source: Sysprof Capture (*.syscap)
ar: لقطة Sysprof (*.syscap)

source: All Files
ar: كل الملفات

source: Run with Profiler
ar: شغل باستخدام محلل الأداء

# menu label
source: Open _Sysprof Capture…
ar: افتح لقطة _Sysprof…

source: Run with _Profiler
ar: شغل باستخدام _محلل الأداء

source: Add sysroot
ar: أضف sysroot

source: Define a new sysroot target to build against a different target
ar: عرف هدف sysroot جديدًا للبناء مستهدفًا هدفًا مختلفًا

source: An absolute file-system path to the sysroot.
ar: مسار نظام ملفات مطلق لـsysroot.

source: Package Config Path
ar: مسار تكوين الحزمة

source: An optional comma-separated path to specify PKG_CONFIG_PATH.
ar: مسار اختياري مفصول بفواصل لتحديد PKG_CONFIG_PATH

source: Use terminal interface
ar: استخدم واجهة طرفية

source: Terminal
ar: طرفية

source: Scrollback
ar: التمرير

source: Terminal Font
ar: خط الطرفية

# Keywords
source: terminal font monospace
ar: monospace terminal font خط طرفية مونو

source: Bold text in terminals
ar: النصوص السميكة في الطرفيات

source: If terminals are allowed to display bold text
ar: ما إذا كان مسموحًا للطرفيات بعرض النصوص السميكة

# Keywords
source: terminal allow bold
ar: terminal allow bold اسمح سميك طرفية

source: Show hyperlinks
ar: أظهر الروابط التشعبية

source: When enabled hyperlinks (OSC 8 escape sequences) are recognized and displayed
ar: عند التمكين سيتم التعرف على الروابط التشعبية (محارف مركبة من طراز OSC 8) وعرضها

# Keywords
source: terminal show hyperlinks links urls
ar: terminal show hyperlinks links urls روابط عرض طرفية

source: Scroll on output
ar: التمرير عند عرض المخرجات

source: When enabled the terminal will scroll to the bottom when new output is displayed
ar: عند التمكين ستُمرر الطرفية إلى الأسفل عند عرض مخرجات جديدة

# Keywords
source: scroll on output
ar: scroll on output تمرير مخرجات

source: Scroll on keystroke
ar: التمرير عند الضغط على مفتاح

source: When enabled the terminal will scroll to the bottom when typing
ar: عند التمكين ستُمرر الطرفية إلى الأسفل عند الضغط على مفتاح

# Keywords
source: scroll on keystroke
ar: scroll on keystroke تمرير ضغط مفتاح

source: Limit Scrollback
ar: تقييد التمرير

source: When enabled terminal scrollback will be limited to the number of lines specified below
ar: عند التمكين سيقتصر التمرير على عدد الأسطر المحدد تاليا

# Keywords
source: scrollback limit
ar: حدود التمرير

source: Scrollback Lines
ar: أسطر التمرير

source: The number of lines to keep available for scrolling
ar: عدد الأسطر المتوفرة للتمرير

# Keywords
source: scrollback lines
ar: أسطر التمرير

source: Application Output
ar: مخرجات التطبيق

source: Application started at %s
ar: بدأ التطبيق عند %s

source: Application exited
ar: خرج التطبيق

source: Terminal in Build Runtime
ar: طرفية في بيئة البناء

source: Terminal in Runtime
ar: طرفية في بيئة التنفيذ

source: New _Terminal
ar: _طرفية جديدة

source: New _Build Terminal
ar: طرفية _بناء جديدة

source: New _Runtime Terminal
ar: طرفية ت_نفيذ جديدة

source: Unit Test Output
ar: مخرجات اختبارات الوحدات

source: Clear test output
ar: فرغ مخرجات الاختبار

source: Cancel tests
ar: ألغ الاختبارات

source: Save test output
ar: احفظ مخرجات الاختبار

source: Unit Tests
ar: اختبارات الوحدات

source: Running test “%s”…
ar: تشغيل الاختبار “%s”…

source: Loading TODOs…
ar: تحميل قائمة المؤجلات…

source: Please wait while we scan your project
ar: يرجى الانتظار ريثما يتم مسح مشروعك

source: TODO/FIXMEs
ar: مهام مؤجلة/إصلاحات مؤجلة

source: Updating Builder
ar: تحديث الباني

source: Update Available
ar: يوجد تحديث متاح

source: An update to Builder is available. Builder can download and install it for you.
ar: يتوفر تحديث للباني. يمكن للباني تنزيل التحديث وتنصيبه.

source: _Update
ar: ت_حديث

source: Run with Valgrind
ar: شغل باستخدام Valgrind

source: Branches
ar: فروع

source: Tags
ar: علامات

source: _Switch to branch
ar: _بدل إلى الفرع

source: _Push to origin
ar: ا_دفع غلى المستودع الأصلي

source: Number required
ar: الرقم مطلوب

source: %s is invalid for %s
ar: %s غير صالحة لـ%s

source: Cannot find language “%s”
ar: فشل العثور على اللغة “%s”

source: This command requires a GtkSourceView to be focused
ar: يتطلب هذا الأمر أن يكون التركيز على GtkSourceView

source: This command requires a view to be focused
ar: يتطلب هذا الأمر أن يكون التركيز على نافذة عرض

source: Unknown option: %s
ar: خيار غير معروف: %s

source: Cannot find colorscheme “%s”
ar: فشل إيجاد مخطط الألوان “%s”

source: Failed to locate working directory
ar: فشل العثور على مجلد العمل الحالي

source: Invalid :syntax subcommand: %s
ar: الأمر الفرعي في بناء الجملة غير صالح: %s

source: Invalid search and replace request
ar: طلب بحث واستبدال غير صالح

source: Change the pages colorscheme
ar: غيُر مخطط الألوان الخاص بالصفحة

source: Build the project
ar: بناء المشروع

source: Clear search highlighting
ar: أزل تظليل البحث

source: Open a file by path
ar: افتح ملفًا باستخدام المسار

source: Close the page
ar: أغلق الصفحة

source: Set various buffer options
ar: قم بتعين خيارات الصوانات المختلفة

source: Sort the selected lines
ar: رتب الأسطر المحددة

source: Create a split page below the current page
ar: أنشئ قسمًا أسفل الصفحة الحالية

source: Toggle syntax highlighting
ar: تبديل تظليل النحو

source: Save and close the current page
ar: احفظ وأغلق الصفحة الحالية

source: Save the current page
ar: احفظ الصفحة الحالية

source: Not a command: %s
ar: ليس أمرًا: %s

source: Emulates the Vim text editor
ar: محاكاة محرر نصوص Vim

source: Building project…
ar: بناء المشروع…

source: Installing project…
ar: تثبيت المشروع…

source: Failed to create the XML tree.
ar: فشل في إنشاء شجرة XML

source: File must be saved locally to parse.
ar: يجب حفظ الملف محليًا ليتم تحليله

source: Install
ar: ثبّت

source: Update
ar: حدّث

source: Search Preferences
ar: ابحث ضمن الإعدادات

source: The “flatpak-builder” program is necessary for building Flatpak-based applications. Alwarsha can install it for you.
ar: برنامج “flatpak-builder” ضروري لبناء التطبيقات التي تعتمد على يمكن للورشة تنصيبه لك Flatpak

# menu label
source: Open Sysprof Capture…
ar: افتح لقطة Sysprof…

source: Browse…
ar: تصفح…

source: Alusus
ar: الأسس

source: Alusus Project - Arabic
ar: مشروع الأسس - عربية

source: Create an Arabic based Alusus project
ar: أنشئ مشروعًا بالنسخة العربية من لغة الأسس

source: Alusus Project - English
ar: مشروع الأسس - إنجليزية

source: Create an English based Alusus project
ar: أنشئ مشروعًا بالنسخة الإنجليزية من لغة الأسس
